Revit 2024 API
ShapeBuilder Class
 The base class for geometry builder classes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class ShapeBuilder : IDisposable
Visual Basic
Public Class ShapeBuilder _
	Implements IDisposable
Visual C++
public ref class ShapeBuilder : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeBuilder
 Autodesk.Revit.DB.BRepBuilder
 Autodesk.Revit.DB.TessellatedShapeBuilder
 Autodesk.Revit.DB.ViewShapeBuilder
 Autodesk.Revit.DB.WireframeBuilder
See Also
ShapeBuilder Members
Autodesk.Revit.DB Namespace